src/Documents/ВходящийСчетФактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Document>
		<Properties>
			<Name>ВходящийСчетФактура</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьОжиданияОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектронногоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектронногоОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
					<Comment>Документы основания для выписки счета-фактуры</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ВходящийСчетФактура/Ext/ObjectModule.bsl
Функция НайтиПоступлениеПоНомеруИДате(НомерРеализации, ДатаРеализации)
	
	ДатаНачалаПериода = НачалоГода(ДатаРеализации);
	ДатаКонцаПериода = КонецГода(ДатаРеализации);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПоступлениеТоваровУслуг.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |ГДЕ
	               |	ПоступлениеТоваровУслуг.НомерВходящегоДокументаЭлектронногоОбмена = &НомерВходящегоДокументаЭлектронногоОбмена
	               |	И ПоступлениеТоваровУслуг.ДатаВходящегоДокументаЭлектронногоОбмена <= &ДатаКонцаПериода
	               |	И ПоступлениеТоваровУслуг.ДатаВходящегоДокументаЭлектронногоОбмена >= &ДатаНачалаПериода
	               |	И ПоступлениеТоваровУслуг.ПометкаУдаления = ЛОЖЬ";
				   
	Запрос.УстановитьПараметр("НомерВходящегоДокументаЭлектронногоОбмена", НомерРеализации);
	Запрос.УстановитьПараметр("ДатаНачалаПериода", ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаКонцаПериода", ДатаКонцаПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

Функция ЗагрузитьЭлементХМЛ(ОбъектXML, ИмяУзла, Параметры) Экспорт
	
	Если ИмяУзла = "СчетФактура" Тогда
		
	ИначеЕсли ИмяУзла = "ДлительностьОжиданияОтвета" Тогда
		ДлительностьОжиданияОтвета = ЭлектронныеДокументы.ПолучитьДлительностьЭлемента(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "НомерСчетФактураПоставщик" Тогда
		НомерСчетаФактуры = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "ДатаСчетФактураПоставщик" Тогда
		ДатаСчетаФактуры = ЭлектронныеДокументы.ПолучитьДатуЭлемента(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "СтрокаСчетФактура" Тогда
					
	ИначеЕсли   ИмяУзла = "ИдТовара" Тогда
			
	ИначеЕсли   ИмяУзла = "НомерТоварнойНакладной" Тогда
		
		НомерТоварнойНакладной = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);
		Параметры.Вставить("НомерТоварнойНакладной", НомерТоварнойНакладной);
		
	ИначеЕсли   ИмяУзла = "ДатаТоварнойНакладной" Тогда
		
		ДатаТоварнойНакладной = ЭлектронныеДокументы.ПолучитьДатуЭлемента(ОбъектXML);
		
		// нужно искать поступление по номеру и дате реализации
		//НомерВходящегоДокументаЭлектронногоОбмена
		//ДатаВходящегоДокументаЭлектронногоОбмена
		
		Накладная = НайтиПоступлениеПоНомеруИДате(Параметры.НомерТоварнойНакладной, ДатаТоварнойНакладной);
		
		Если ЗначениеЗаполнено(Накладная) Тогда
			
			Если ДокументыОснования.Найти(Накладная, "ДокументОснование") = Неопределено Тогда 
				
				СтрокаТовара = ДокументыОснования.Добавить();
				Параметры.Вставить("СтрокаТовара",СтрокаТовара);
				
				СтрокаТовара.ДокументОснование = Накладная;	
				
			КонецЕсли;
		
		КонецЕсли;
	
	ИначеЕсли   ИмяУзла = "ОКЕИ" Тогда
			
	ИначеЕсли ИмяУзла = "Количество" Тогда
			
	ИначеЕсли ИмяУзла = "СуммаПоСтроке" Тогда
		
	ИначеЕсли ИмяУзла = "Сумма" Тогда		
	
	ИначеЕсли ИмяУзла = "Налог" Тогда
		
	ИначеЕсли ИмяУзла = "ТипНалога" Тогда		
				
	ИначеЕсли ИмяУзла = "ВеличинаСтавкиНалога" Тогда		
		
	ИначеЕсли ИмяУзла = "Сумма" Тогда
				
	ИначеЕсли ИмяУзла = "ВключеноВСтоимость" Тогда
						
	ИначеЕсли ИмяУзла = "Примечание" Тогда
					
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СуществуетИсходящийДокумент(СсылкаНаОтветныйДокумент = Неопределено) Экспорт
	
	СсылкаНаОтветныйДокумент = ЭлектронныеДокументы.НайтиПервыйОтветныйДокумент(Ссылка, "ИсходящийРеджектАкцептСчетаФактуры");
	
	Возврат ЗначениеЗаполнено(СсылкаНаОтветныйДокумент);
	
КонецФункции // ()
